{
  "id": "26d0dd3ddc8a73f6d2d1381e196bd098",
  "source": {
    "url": "https://www.linkedin.com/help/linkedin/answer/a1339724",
    "domain": "linkedin.com",
    "site_type": "linkedin",
    "scraped_at": "2025-06-05T13:50:30.698909Z"
  },
  "content": {
    "title": "Help LinkedIn Help",
    "text": "As part of LinkedIn’s commitment to providing a safe, trusted, and professional environment for our members, we try to be as transparent as possible about how we organize and display the content that you see on the platform. Members engage with LinkedIn in different ways: connecting with members they know, following companies and members, searching for people and information, sharing and engaging with content, or looking for new career opportunities, to name a few. We use the information and engagement data that we have about our members and content on our services to make recommendations for connections, content, and features that may be useful to you. We present that information to you in an order that may be more relevant for you. For example, we use algorithms to learn about your interests and to help organize engaging content on your Feed, in addition to recommending relevant jobs and member connections. These algorithms also filter out or taper distribution of low-quality and unsafe content to enhance the value of what you see on your Feed. You can find more information about how we personalize your experience below. Feed A member’s feed includes content from a variety of sources, such as their connections, people or companies they follow, and the groups they belong to. This content could be a followed member’s post, a connection’s comment on someone else’s post, or a post from a group to which the member belongs. A member’s feed may also include content from outside of a member’s network that we think may be relevant to the member. By using machine learning algorithms, LinkedIn is able to assess many signals that help us understand a member’s preferences, and it enables us to provide a diverse, professional, high-quality, and personalized feed experience to each member. The main signals that we assess fall into three categories: Identity: We seek to contextualize content based on who a member is by looking at their profile, for example: Who are you? Where do you work? What are your skills? Where is your profile location? Content: We aim to match appropriate content to each member by evaluating, for example: How many times was the feed update viewed? How many times was it reacted to? What is the content about? How old is it? Is the update sharing knowledge or professional advice? Is the update from someone you are connected to or follow? What language is it written in? Is the conversation constructive and professional? Will engagement on the update lead to future high quality content? What companies, people, or topics are mentioned in the update? Member Activity: Finally, we look at how a member engages with content and examine, for example: What have you reacted to and shared in the past? Who do you interact with most frequently or recently? Where do you spend the most time in your feed? Which hashtags, people or companies do you follow? Who are your connections? What types of topics are you interested in? What other members follow you? What actions have other members taken on your posts? How long has it been since the foregoing actions took place? Other than sponsored content, which is clearly labeled as such, our feed distribution is not influenced by payments from third parties to LinkedIn. Your choices for how information is presented to you: As described in more detail below, a member can control and refine the content of their feed by taking actions, such as by following or unfollowing members, companies, or hashtags, by hiding or reporting content, or by opting to sort feed content by when it was posted. Here are some best practices and controls we provide to you to customize your feed: Control menu - You can tell us what you want to see more and less of by clicking the three dots (...) on a post. This will open a toolbox of options available, including: Unfollow or mute people, companies, and hashtags - You can unfollow or mute people, companies and hashtags if you no longer want to see their posts. Tell us what you dislike - If you see content in your feed that you don't believe to be high-quality or relevant to you, you can choose “I don’t want to see this post”. You can let us know why you aren’t interested in seeing the content anymore. Flag inappropriate content - We encourage you to report inappropriate or offensive content to help us keep LinkedIn constructive. Add new perspectives to your feed - If you want to get updates from a member or company on your feed, you can choose to follow them. You can also subscribe to Newsletters and you can also leverage hashtags to follow topics on LinkedIn. You can navigate directly to the My Network page which displays recommended sources to follow and members with whom to connect. Sort updates - At the top of your LinkedIn homepage, you can control if your feed shows recent updates or organizes updates by relevancy. This feature is only available on the desktop experience. Some of your feed updates may be delivered as push notifications and/or emails. You can control these by customizing your email settings and push notification settings. Search LinkedIn users (including members and guests) can conduct a search at the top of any LinkedIn page. A user has the option to “See all results” for a keyword(s) search or to narrow a search by categories such as jobs, services, people or groups. Our predictive text feature will help predict related search terms as a user types keywords into the search bar; of course, the predictive text feature can be bypassed by typing in keyword(s). The most frequently used search filters will be located at the top of the search results page, and all additional search filters are located in the “All filters” section. The LinkedIn search algorithms are designed to return personalized and relevant search results for each member. While search algorithms may evaluate different pieces of information for each search category, all of our search algorithms are built to return meaningful search results. For example: Our People search algorithm generates unique search results for each member. Search results order is determined, in part, by a member’s profile, activity, and connections, along with considerations such as search activity on LinkedIn, the relative public prominence of certain profiles, and other members who have run similar searches and their engagement with the results. Our Pages search algorithm returns the most active and relevant results based on a search query. The algorithm takes into consideration: Page name Number of Page followers Number of connections a member has that are connected to a Page Volume of discussions and comments on a Page Quality of updates, comments, and reactions on a Page Relative public prominence of certain Pages Maximum ratio of matching search terms to the Jobs We personalize job recommendations to you in the Jobs home tab, on job posts in your feed, and via notifications. LinkedIn Job Recommendations show jobs based on your job searches, job alerts, profile, and activity on LinkedIn. Learn more about how LinkedIn personalizes Job recommendations for you. You can control the jobs you are recommended by updating your profile, using search alerts, turning notifications on or off, searching for jobs, or expressing your preferences when you use the “Open to work” feature. Members in the EEA (European Economic Area) may opt-out of personalized Job recommendations. If you are not in the EEA, you can control your job recommendations as described above. Related Articles Learn how we personalize your ads on LinkedIn and customize your feed.Search on LinkedInView and Delete Your Search HistoryJob Recommendations“People You May Know” FeatureSuggested posts in feed",
    "word_count": 1281,
    "language": "en",
    "images": []
  },
  "metadata": {
    "author": "",
    "publish_date": "",
    "tags": [
      "you",
      "your",
      "search",
      "content",
      "feed",
      "member",
      "linkedin",
      "members",
      "what",
      "how"
    ],
    "content_type": "article"
  },
  "processing": {
    "extraction_method": "site_specific",
    "confidence_score": 0.7999999999999999,
    "chunks": [
      {
        "text": "As part of LinkedIn’s commitment to providing a safe, trusted, and professional environment for our members, we try to be as transparent as possible about how we organize and display the content that you see on the platform. Members engage with LinkedIn in different ways: connecting with members they know, following companies and members, searching for people and information, sharing and engaging with content, or looking for new career opportunities, to name a few. We use the information and engagement data that we have about our members and content on our services to make recommendations for connections, content, and features that may be useful to you. We present that information to you in an order that may be more relevant for you. For example, we use algorithms to learn about your interests and to help organize engaging content on your Feed, in addition to recommending relevant jobs and member connections. These algorithms also filter out or taper distribution of low-quality and unsafe content to enhance the value of what you see on your Feed. You can find more information about how we personalize your experience below. Feed A member’s feed includes content from a variety of sources, such as their connections, people or companies they follow, and the groups they belong to. This content could be a followed member’s post, a connection’s comment on someone else’s post, or a post from a group to which the member belongs. A member’s feed may also include content from outside of a member’s network that we think may be relevant to the member. By using machine learning algorithms, LinkedIn is able to assess many signals that help us understand a member’s preferences, and it enables us to provide a diverse, professional, high-quality, and personalized feed experience to each member. The main signals that we assess fall into three categories: Identity: We seek to contextualize content based on who a member is by looking at their profile, for example: Who are you? Where do you work? What are your skills? Where is your profile location? Content: We aim to match appropriate content to each member by evaluating, for example: How many times was the feed update viewed? How many times was it reacted to? What is the content about? How old is it? Is the update sharing knowledge or professional advice? Is the update from someone you are connected to or follow? What language is it written in? Is the conversation constructive and professional? Will engagement on the update lead to future high quality content? What companies, people, or topics are mentioned in the update? Member Activity: Finally, we look at how a member engages with content and examine, for example: What have you reacted to and shared in the past? Who do you interact with most frequently or recently? Where do you spend the most time in your feed? Which hashtags, people or companies do you follow? Who are your connections? What types of topics are you interested in? What other members follow you? What actions have other members taken on your posts? How long has it been since the foregoing actions took place? Other than sponsored content, which is clearly labeled as such, our feed distribution is not influenced by payments from third parties to LinkedIn. Your choices for how information is presented to you: As described in more detail below, a member can control and refine the content of their feed by taking actions, such as by following or unfollowing members, companies, or hashtags, by hiding or reporting content, or by opting to sort feed content by when it was posted. Here are some best practices and controls we provide to you to customize your feed: Control menu - You can tell us what you want to see more and less of by clicking the three dots (...) on a post. This will open a toolbox of options available, including: Unfollow or mute people, companies, and hashtags - You can unfollow or mute people, companies and hashtags if you no longer want to see their posts. Tell us what you dislike - If you see content in your feed that you don't believe to be high-quality or relevant to you, you can choose “I don’t want to see this post”. You can let us know why you aren’t interested in seeing the content anymore. Flag inappropriate content - We encourage you to report inappropriate or offensive content to help us keep LinkedIn constructive. Add new perspectives to your feed - If you want to get updates from a member or company on your feed, you can choose to follow them. You can also subscribe to Newsletters and you can also leverage hashtags to follow topics on LinkedIn. You can navigate directly to the My Network page which displays recommended sources to follow and members with whom to connect. Sort updates - At the top of your LinkedIn homepage, you can control if your feed shows recent updates or organizes updates by relevancy. This feature is only available on the desktop experience. Some of your feed updates may be delivered as push notifications and/or emails. You can control these by customizing your email settings and push notification settings. Search LinkedIn users (including members and guests) can conduct a search at the top of any LinkedIn page. A user has the option to “See all results” for a keyword(s) search or to narrow a search by categories such as jobs, services, people or groups. Our predictive text feature will help predict related search terms as a user types keywords into the search bar; of course, the predictive text feature can be bypassed by typing in keyword(s). The most frequently used search filters will be located at the top of the search results page, and all additional search filters are located in the “All filters” section. The LinkedIn search algorithms are designed to return personalized and relevant search results for each member. While search algorithms may evaluate different pieces of information for each search",
        "position": 1,
        "char_count": 5905
      },
      {
        "text": "category, all of our search algorithms are built to return meaningful search results. For example: Our People search algorithm generates unique search results for each member. Search results order is determined, in part, by a member’s profile, activity, and connections, along with considerations such as search activity on LinkedIn, the relative public prominence of certain profiles, and other members who have run similar searches and their engagement with the results. Our Pages search algorithm returns the most active and relevant results based on a search query. The algorithm takes into consideration: Page name Number of Page followers Number of connections a member has that are connected to a Page Volume of discussions and comments on a Page Quality of updates, comments, and reactions on a Page Relative public prominence of certain Pages Maximum ratio of matching search terms to the Jobs We personalize job recommendations to you in the Jobs home tab, on job posts in your feed, and via notifications. LinkedIn Job Recommendations show jobs based on your job searches, job alerts, profile, and activity on LinkedIn. Learn more about how LinkedIn personalizes Job recommendations for you. You can control the jobs you are recommended by updating your profile, using search alerts, turning notifications on or off, searching for jobs, or expressing your preferences when you use the “Open to work” feature. Members in the EEA (European Economic Area) may opt-out of personalized Job recommendations. If you are not in the EEA, you can control your job recommendations as described above. Related Articles Learn how we personalize your ads on LinkedIn and customize your feed.Search on LinkedInView and Delete Your Search HistoryJob Recommendations“People You May Know” FeatureSuggested posts in feed",
        "position": 2,
        "char_count": 1812
      }
    ]
  }
}