{
  "id": "e4c3b2bdead0f9459adfebebe19eb09f",
  "source": {
    "url": "https://www.linkedin.com/blog/engineering/generative-ai/how-linkedin-built-the-engineering-infrastructure-to-ignite-prof",
    "domain": "linkedin.com",
    "site_type": "linkedin",
    "scraped_at": "2025-06-05T13:50:20.194659Z"
  },
  "content": {
    "title": "How LinkedIn Built the Engineering Infrastructure to Ignite Professional Knowledge Sharing",
    "text": "Generative AI How LinkedIn Built the Engineering Infrastructure to Ignite Professional Knowledge Sharing Authored byShweta Patira Sr Director of Engineering @ Reddit | Board Member | Speaker | Previous - LinkedIn, HBO, Microsoft November 20, 2023 Co-Authors: Shweta Patira, Ankan Saha, Yilin Li, and Manas Somaiya Earlier this year, we launched Collaborative Articles with the vision of making LinkedIn the one-stop destination for all work-related questions. Among our 1 billion members, there are seasoned experts who have encountered every conceivable workplace problem. If we could present their thoughts on LinkedIn, then mentors, experts, and coaches would be right at our members' fingertips. So we set off to make that happen. Rather than following the traditional Q&A path for gathering perspectives, we embarked on a slightly non-traditional journey. We started by crafting articles across a wide array of professional topics and asked experts to add their ideas, stories, and advice. The result? Collaborative Articles are work-related questions accompanied by AI-powered conversation starters, where professionals share real-life advice. For instance, if a member is grappling with managing a difficult team member, they can discover tips from experts who've navigated the same waters. Here is a little bit about our journey to date and how Collaborative Articles came to be. Fast-Paced Sprinting - Building an Early Generative AI Product in Record Time Building and launching Collaborative Articles was both intense and exhilarating. We tackled major challenges: first, generating a vast array of real-life questions and accompanying them with AI-generated starter articles; second, identifying and then matching experts to provide meaningful answers; and third, delivering articles to relevant members across the platform. We use AI in many of our products at LinkedIn, but this was different. The infancy of Generative AI (GAI) at the time required us to build much of the necessary GAI tooling from the ground up. It was a sprint to build out our first GAI product and accompanying tech while wanting to swiftly validate if we were truly onto something of real value to our members. Systems, Systems, And More Systems We assembled a scrappy team with the mantra of “Progress over Perfection.” One team of engineers focused on prompt engineering and tooling, while another built the article viewing experience and contribution system. The third team, led by AI engineers, was dedicated to expert identification and matching. Behind the Scenes with PromptsSimilar to others looking to leverage GAI, we were learning how to author large language model (LLM) prompts and quickly discovered that prompt workflows are quite involved, each requiring a few fundamental building blocks. Each new iteration of a prompt required a few hours of inference to generate sample responses, which would get collected into huge spreadsheets and distributed to a team of editors. These editors would review the prompt outputs from the previous day and score the results, providing a signal for the next prompt iteration. We needed to streamline this workflow, so we built a versioned prompt templating system, single or multi-step prompts, and human and automated prompt response evaluation that incorporated both content quality and scoringPrototyping with Tape - Rip, Replace, RepeatOur hack-track was a team of three engineers on a mission to create new variants of Collaborative Articles so that we could explore different avenues. They were on a daily mission to create new variants of the member experience. The mocked-up prototypes in code allowed internal teams to play with changes, provide feedback, and keep the member interface iterations rolling. For us, it was important to keep that level of flexibility and abstraction in the prototyping phase. It set the teams up to explore and truly learn from this new build experience.Connecting the DotsAfter extensive prototyping, it was time to connect the dots. We scaled up topic generation, sent starter articles for editorial review, and slotted approved articles into publishing queues. Then came distribution, which involved connecting millions of experts with members needing insights. We planned to ensure these expert voices reached members who’d use these insights where they were, finding them through search engines or engaging with them on LinkedIn in their feeds, InMails, and notifications. Once all the pieces aligned, we were ready to share Collaborative Articles with our broader LinkedIn community.Signals of MasteryAn integral part of this infrastructure was recognizing real experts, which was harder than it seemed. Though were equipped with many direct and indirect signals to gauge a members skill proficiency, there’s also a lot of noise. Some of these signals have low coverage, while others have low precision. Ultimately, signals that worked reasonably were a combination of explicit skills - skills on profiles, skill endorsements from others, recent job titles - and implicit skills, which are inferred based on recent hires for job postings or a members self-evaluation during job applications.nbsp; Additionally, we added insights such as the likelihood of the member adding original thoughts based on their past content shared on LinkedIn. This gave us a reasonable starting point for expert identification. Once experts started contributing their thoughts, we fine-tuned this process and assessed how engaging and valuable expert opinions were to the community. This is where the magic happened – turning a combination of raw signals into actionable insights where we can better match experts with articles where they can add their perspectives, answers, and insights.Supporting Trust While Surfacing the GemsAt LinkedIn, trust forms the bedrock of everything we build. For Collaborative Articles, where we invite multiple experts to contribute to a single question, our defenses had to be smart not to stifle diverse viewpoints and healthy debates. Yet, they must identify and quickly remove unwanted, policy-violating content. Our trust classifiers actively identify and filter out unsafe, harmful, and unprofessional content that doesn’t align with our platform policies. Our reactive defenses also empower members to swiftly report problematic content, enabling us to take quick action to safeguard our community. We enforce strict penalties for repeat offenders, revoking contribution access to any future articles. This comprehensive approach ensures that we invite and encourage diverse viewpoints in a safe, professional environment.Six Months In: From Launch to Growing Momentum﻿Its been just over six months since the launch of collaborative articles. Weve celebrated our one-millionth expert contribution, and its clear that more and more members are turning to expert answers as their guidebook for work-related challenges. In the past month alone, weve witnessed a 74% surge in the number of articles read by our members. Collaborative Articles are also swiftly becoming one of the fastest-growing traffic drivers to LinkedIn. As engineers, theres no greater thrill than providing people with a powerful platform for expression on a massive scale. Reflecting on this journey, we recognize the many factors contributing to our success. However, with their boundless enthusiasm and exceptional talent, our dream team reigns supreme at the top of that list. Topics: Feed AI Skills Infrastructure Related articles AI Building the next generation of job search at LinkedIn Caleb Johnson May 29, 2025 AI JUDE: LLM-based representation learning for LinkedIn job recom... Nikita Zhiltsov May 22, 2025 Infrastructure Powering Apache Pinot ingestion with Hoptimator Ryanne Dolan Apr 18, 2025",
    "word_count": 1177,
    "language": "en",
    "images": []
  },
  "metadata": {
    "author": "",
    "publish_date": "",
    "tags": [
      "articles",
      "our",
      "linkedin",
      "members",
      "experts",
      "collaborative",
      "their",
      "team",
      "prompt",
      "member"
    ],
    "content_type": "article"
  },
  "processing": {
    "extraction_method": "site_specific",
    "confidence_score": 0.7999999999999999,
    "chunks": [
      {
        "text": "Generative AI How LinkedIn Built the Engineering Infrastructure to Ignite Professional Knowledge Sharing Authored byShweta Patira Sr Director of Engineering @ Reddit | Board Member | Speaker | Previous - LinkedIn, HBO, Microsoft November 20, 2023 Co-Authors: Shweta Patira, Ankan Saha, Yilin Li, and Manas Somaiya Earlier this year, we launched Collaborative Articles with the vision of making LinkedIn the one-stop destination for all work-related questions. Among our 1 billion members, there are seasoned experts who have encountered every conceivable workplace problem. If we could present their thoughts on LinkedIn, then mentors, experts, and coaches would be right at our members' fingertips. So we set off to make that happen. Rather than following the traditional Q&A path for gathering perspectives, we embarked on a slightly non-traditional journey. We started by crafting articles across a wide array of professional topics and asked experts to add their ideas, stories, and advice. The result? Collaborative Articles are work-related questions accompanied by AI-powered conversation starters, where professionals share real-life advice. For instance, if a member is grappling with managing a difficult team member, they can discover tips from experts who've navigated the same waters. Here is a little bit about our journey to date and how Collaborative Articles came to be. Fast-Paced Sprinting - Building an Early Generative AI Product in Record Time Building and launching Collaborative Articles was both intense and exhilarating. We tackled major challenges: first, generating a vast array of real-life questions and accompanying them with AI-generated starter articles; second, identifying and then matching experts to provide meaningful answers; and third, delivering articles to relevant members across the platform. We use AI in many of our products at LinkedIn, but this was different. The infancy of Generative AI (GAI) at the time required us to build much of the necessary GAI tooling from the ground up. It was a sprint to build out our first GAI product and accompanying tech while wanting to swiftly validate if we were truly onto something of real value to our members. Systems, Systems, And More Systems We assembled a scrappy team with the mantra of “Progress over Perfection.” One team of engineers focused on prompt engineering and tooling, while another built the article viewing experience and contribution system. The third team, led by AI engineers, was dedicated to expert identification and matching. Behind the Scenes with PromptsSimilar to others looking to leverage GAI, we were learning how to author large language model (LLM) prompts and quickly discovered that prompt workflows are quite involved, each requiring a few fundamental building blocks. Each new iteration of a prompt required a few hours of inference to generate sample responses, which would get collected into huge spreadsheets and distributed to a team of editors. These editors would review the prompt outputs from the previous day and score the results, providing a signal for the next prompt iteration. We needed to streamline this workflow, so we built a versioned prompt templating system, single or multi-step prompts, and human and automated prompt response evaluation that incorporated both content quality and scoringPrototyping with Tape - Rip, Replace, RepeatOur hack-track was a team of three engineers on a mission to create new variants of Collaborative Articles so that we could explore different avenues. They were on a daily mission to create new variants of the member experience. The mocked-up prototypes in code allowed internal teams to play with changes, provide feedback, and keep the member interface iterations rolling. For us, it was important to keep that level of flexibility and abstraction in the prototyping phase. It set the teams up to explore and truly learn from this new build experience.Connecting the DotsAfter extensive prototyping, it was time to connect the dots. We scaled up topic generation, sent starter articles for editorial review, and slotted approved articles into publishing queues. Then came distribution, which involved connecting millions of experts with members needing insights. We planned to ensure these expert voices reached members who’d use these insights where they were, finding them through search engines or engaging with them on LinkedIn in their feeds, InMails, and notifications. Once all the pieces aligned, we were ready to share Collaborative Articles with our broader LinkedIn community.Signals of MasteryAn integral part of this infrastructure was recognizing real experts, which was harder than it seemed. Though were equipped with many direct and indirect signals to gauge a members skill proficiency, there’s also a lot of noise. Some of these signals have low coverage, while others have low precision. Ultimately, signals that worked reasonably were a combination of explicit skills - skills on profiles, skill endorsements from others, recent job titles - and implicit skills, which are inferred based on recent hires for job postings or a members self-evaluation during job applications.nbsp; Additionally, we added insights such as the likelihood of the member adding original thoughts based on their past content shared on LinkedIn. This gave us a reasonable starting point for expert identification. Once experts started contributing their thoughts, we fine-tuned this process and assessed how engaging and valuable expert opinions were to the community. This is where the magic happened – turning a combination of raw signals into actionable insights where we can better match experts with articles where they can add their perspectives, answers, and insights.Supporting Trust While Surfacing the GemsAt LinkedIn, trust forms the bedrock of everything we build. For Collaborative Articles, where we invite multiple experts to contribute to a single question, our defenses had to be smart not to stifle diverse viewpoints and healthy debates. Yet, they must identify and quickly remove unwanted, policy-violating content. Our trust classifiers actively identify and filter out unsafe, harmful, and unprofessional content that doesn’t align with our platform policies. Our reactive defenses also empower members to swiftly report problematic content, enabling us to take quick action to safeguard our community. We enforce strict penalties for repeat offenders, revoking contribution access to any future articles. This comprehensive approach ensures that we invite and encourage diverse viewpoints in a safe,",
        "position": 1,
        "char_count": 6602
      },
      {
        "text": "professional environment.Six Months In: From Launch to Growing Momentum﻿Its been just over six months since the launch of collaborative articles. Weve celebrated our one-millionth expert contribution, and its clear that more and more members are turning to expert answers as their guidebook for work-related challenges. In the past month alone, weve witnessed a 74% surge in the number of articles read by our members. Collaborative Articles are also swiftly becoming one of the fastest-growing traffic drivers to LinkedIn. As engineers, theres no greater thrill than providing people with a powerful platform for expression on a massive scale. Reflecting on this journey, we recognize the many factors contributing to our success. However, with their boundless enthusiasm and exceptional talent, our dream team reigns supreme at the top of that list. Topics: Feed AI Skills Infrastructure Related articles AI Building the next generation of job search at LinkedIn Caleb Johnson May 29, 2025 AI JUDE: LLM-based representation learning for LinkedIn job recom... Nikita Zhiltsov May 22, 2025 Infrastructure Powering Apache Pinot ingestion with Hoptimator Ryanne Dolan Apr 18, 2025",
        "position": 2,
        "char_count": 1178
      }
    ]
  }
}